<!-- dflook/terraform-github-actions {"workspace":"default","backend":"184ba4786776d6bdb300b897807dc800d68ae8da4dadda4b3c5e5febcefd4926","backend_type":"artifactory"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.keycloak will be created
  + resource "helm_release" "keycloak" {
      + atomic                     = false
      + chart                      = "keycloakx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "keycloak"
      + namespace                  = "b0f542-dev"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://codecentric.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "1.3.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.postgresql will be created
  + resource "helm_release" "postgresql" {
      + atomic                     = false
      + chart                      = "postgresql"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "postgresql"
      + namespace                  = "b0f542-dev"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "11.3.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_network_policy.sdpr_network_policy will be created
  + resource "kubernetes_network_policy" "sdpr_network_policy" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "sdpr-network-policy"
          + namespace        = "b0f542-dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + policy_types = [
              + "Ingress",
              + "Egress",
            ]

          + egress {
            }

          + ingress {
              + from {

                  + namespace_selector {
                      + match_labels = {
                          + "network.openshift.io/policy-group" = "ingress"
                        }
                    }
                }
            }

          + pod_selector {
            }
        }
    }

  # kubernetes_network_policy.sdpr_network_policy_internal will be created
  + resource "kubernetes_network_policy" "sdpr_network_policy_internal" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "sdpr-network-policy-internal"
          + namespace        = "b0f542-dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + policy_types = [
              + "Ingress",
            ]

          + ingress {
              + from {

                  + pod_selector {
                    }
                }
            }

          + pod_selector {
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:x: Plan not applied in [Apply terraform plan #7](https://github.com/bcgov/social-access-portal/actions/runs/2410329259) (Plan has changed)